Documents/ПокупкаКорма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПокупкаКорма</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиРыб</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аквариум</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аквариум</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьКорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиРыб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиРыб</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Аквариум</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аквариум</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПородаРыб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПородаРыб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПокупкаКорма/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиРыб.Записывать = Истина;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 			"ВЫБРАТЬ			|	ОстаткиРыбОстатки.ПородаРыб КАК ПородаРыб,			|	ОстаткиРыбОстатки.КоличествоОстаток КАК Количество			|ИЗ			|	РегистрНакопления.ОстаткиРыб.Остатки(&Период, Аквариум = &ВыбранныйАквариум) КАК ОстаткиРыбОстатки";	
		
		Запрос.УстановитьПараметр("Период", МоментВремени());		Запрос.УстановитьПараметр("ВыбранныйАквариум", Аквариум);    
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если РезультатЗапроса.Пустой() Тогда			Сообщить("В выбранном аквариуме нет рыб");			Отказ = Истина;			Возврат;		КонецЕсли;
	
		ВсегоРыбВАквариуме = 0;		
		ПодсчетКоличества = РезультатЗапроса.Выбрать();  
		
		Пока ПодсчетКоличества.Следующий() Цикл			ВсегоРыбВАквариуме = ВсегоРыбВАквариуме + ПодсчетКоличества.Количество;		КонецЦикла;			Если ВсегоРыбВАквариуме = 0 Тогда			Сообщить("Количество рыб равно нулю. Проведение невозможно.");			Отказ = Истина;			Возврат;		КонецЕсли;    
	
		СтоимостьНаОднуРыбу = СтоимостьКорма / ВсегоРыбВАквариуме;  
		
		РаспределениеСтоимости = РезультатЗапроса.Выбрать();   
				Пока РаспределениеСтоимости.Следующий() Цикл
			ДоляСтоимостиПороды = РаспределениеСтоимости.Количество * СтоимостьНаОднуРыбу;  
		
			НовоеДвижение = Движения.ОстаткиРыб.Добавить(); 			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;

			НовоеДвижение.Период = Дата;			НовоеДвижение.Аквариум = Аквариум;			НовоеДвижение.ПородаРыб = РаспределениеСтоимости.ПородаРыб; 
			
			НовоеДвижение.Количество = 0;
			НовоеДвижение.Сумма = ДоляСтоимостиПороды;
		КонецЦикла;    
		
КонецПроцедуры
